In [ ]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = {
    'Country' : ['Belgium', 'India', 'Brazil'],
    'Capital' : ['Brussels', 'New Delhi', 'Brasilia'],
    'Population' :[11190846, 1303171035, 207847528]
}

# Series

In [3]:
s1 = pd.Series(data['Country'])
s1

0    Belgium
1      India
2     Brazil
dtype: object

In [4]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [5]:
s1.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
s1 = pd.Series(data['Country'], index=['A', 'B', 'C'])
s1

A    Belgium
B      India
C     Brazil
dtype: object

In [7]:
s1.index

Index(['A', 'B', 'C'], dtype='object')

# DataFrame

In [8]:
df1= pd.DataFrame(data)
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [9]:
df1['Country']

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [10]:
type(df1['Country'])

pandas.core.series.Series

In [11]:
df1.iterrows()

In [19]:
for row in df1.iterrows():
    print("row", row)
    print("type(row)",type(row))
    print("len(row)", len(row))
    print("row0", row[0])
    print("row1", row[1])
    print("type row0", type(row[0]))
    print("type row1", type(row[1]))
    break

row (0, Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object)
type(row) <class 'tuple'>
len(row) 2
row0 0
row1 Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object
type row0 <class 'int'>
type row1 <class 'pandas.core.series.Series'>

In [20]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [27]:
s1 = pd.Series(data['Country'])
s2 = pd.Series(data['Capital'])
s3 = pd.Series(data['Population'])
df_new = pd.DataFrame([s1,s2,s3], index = ['Country','Capital','Population' ])
df_new

                   0           1          2
Country      Belgium       India     Brazil
Capital     Brussels   New Delhi   Brasilia
Population  11190846  1303171035  207847528

In [28]:
df_new.T

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [24]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528